Rhino.Inside.Revit API
Revit Properties
The Revit type exposes the following members.
Properties
Name | Description
ActiveDBApplication
 Gets the active Autodesk.Revit.ApplicationServices.Application in the current DB session.
ActiveDBDocument
 Gets the active Autodesk.Revit.DB.Document in the Revit UI.
ActiveUIApplication
 Gets the active Autodesk.Revit.UI.UIApplication in the current UI session.
ActiveUIDocument
 Gets the active Autodesk.Revit.UI.UIDocument in the Revit UI.
Top
See Also
Reference
Revit Class
RhinoInside.Revit Namespace